{
    "Page": {
        "sections": {
            "skillsModule": "/// وحدة.المهارات",
            "experienceModule": "/// وحدة.الخبرة",
            "loading": "جاري التحميل..."
        }
    },
    "About": {
        "title": "سجل الهوية",
        "paragraph1": "أبني في تقاطع الهوية والكود والخيال، حيث كل مكون هو إشارة في التبادل المستمر بين الإنسان والآلة. عملي معياري ومتفاعل ومتصل بالنوايا مثل الدوائر التي تنبض عبر واجهة حية.",
        "paragraph2": "أصمم أنظمة تشعر بالحياة. كل بكسل له سبب للوجود. كل حركة هي محادثة. سواء كان React أو Tailwind أو الشيدرز أو آلات الحالة، أدواتي تشكل تجارب متجاوبة وغامرة تشعر بقدر ما تعمل.",
        "paragraph3": "هذا ليس مجرد معرض أعمال. إنها شبكة. انعكاس لكيفية تفكيري وإبداعي وتواصلي. مساحة حيث الإبداع يتدفق مثل البيانات والواجهات تطن بالطاقة.",
        "closing": "أنا HUMBLEF0OL—مرحباً بك في دائرتي.",
        "location_latlong": "خط العرض: 28.5143629° شمال | خط الطول: 77.0730087° شرق",
        "location_sysid": "الشبكة: القطاع-21E / معرف النظام: HUMBLEF0OL"
    },
    "Contact": {
        "sectionTitle": "اتصل بي",
        "introTitle": "لقد وصلت إلى محطة إرسال HUMBLEFOOL، البوابة العصبية حيث يلتقي الكود بالمحادثة.",
        "uplinkMessage": "سواء كنت مطور زميل، أو صانع أفكار، أو مجند من المستقبل — هذا هو رابطك العلوي. أرسل رسالة وسأوجهها عبر شبكتي العصبية.",
        "terminalLabel": "المحطة_العصبية_v2.1",
        "terminalMessages": {
            "linkEstablished": "تم_تأسيس_الرابط_العصبي...",
            "scanningThreats": "فحص_التهديدات...",
            "firewallActive": "جدار_الحماية_نشط...",
            "readyTransmission": "جاهز_للإرسال...",
            "awaitingInput": "في_انتظار_الإدخال..."
        },
        "statusOnline": "متصل",
        "statusSecure": "آمن",
        "statusMonitored": "مراقب",
        "form": {
            "title": "إرسال_آمن",
            "nameLabel": "إدخال_الاسم",
            "namePlaceholder": "أدخل توقيعك...",
            "emailLabel": "بروتوكول_البريد",
            "emailPlaceholder": "your@email.com",
            "messageLabel": "حمولة_الرسالة",
            "messagePlaceholder": "أرسل حزمة البيانات الخاصة بك...",
            "sendButton": "إرسال الرسالة",
            "sendingButton": "جاري الإرسال..."
        },
        "footerStatus": "حالة_النظام: تشغيلي",
        "footerTime": "الوقت_المحلي"
    },
    "CyberIDCard": {
        "header": {
            "title": "بث الهوية",
            "subtitle": "جلسة آمنة",
            "id": "المعرف: HUMBLEFOOL",
            "ping": " البينغ: 9XK-JU42-FELIS"
        },
        "identity": {
            "nameLabel": "الاسم",
            "nameValue": "أميت رانا",
            "roleLabel": "الدور",
            "roleValue": "مهندس تطوير أول",
            "statusLabel": "الحالة",
            "statusValue": "متصل",
            "versionLabel": "الإصدار",
            "versionValue": "v3.2.7"
        },
        "log": {
            "auth": "[ موافق ] المصادقة: نجح",
            "github": "[ النظام ] GitHub متصل",
            "memory": "[ النواة ] الذاكرة مُحملة: 92%",
            "renderer": "[ العقدة ] المُعرض البصري: مستقر",
            "creativity": "[ معلومات ] محرك الإبداع: نشط"
        },
        "barcode": {
            "label": "// كود المعرف المتسلسل //"
        }
    },
    "Experience": {
        "sectionTitle": "سجل الخبرة",
        "terminalLogStart": {
            "userId": " [  معرف.المستخدم  ] _HUMBLEF00L_",
            "accessLevel": " [  مستوى الوصول  ] مُخول // التصريح: المستوى-03",
            "timeframe": " [  الفترة الزمنية  ] سجل النشاط -- 2022 ▶ 2025"
        },
        "tabs": {
            "sde2": {
                "labelFull": "مهندس تطوير البرمجيات 2",
                "labelShort": "SDE 2"
            },
            "sde1": {
                "labelFull": "مهندس تطوير البرمجيات 1",
                "labelShort": "SDE 1"
            },
            "intern": {
                "labelFull": "متدرب تطوير البرمجيات",
                "labelShort": "متدرب SDE"
            }
        },
        "content": {
            "operationsLabel": "العمليات",
            "sde2": {
                "title": "مهندس تطوير البرمجيات 2",
                "period": "يوليو 2023 – الحاضر",
                "op1": "صممت وأطلقت واجهة أمامية قابلة للتوسع يستخدمها أكثر من 300 ألف مستخدم باستخدام Next.js و Tailwind CSS، محققاً 95+ في Core Web Vitals للأداء وتحسين محركات البحث وإمكانية الوصول.",
                "op2": "صممت هندسة الواجهة الأمامية قائداً التعاون متعدد الوظائف مع فرق المنتج والخلفية والتصميم.",
                "op3": "دمجت ميزات PWA لزيادة المشاركة المحمولة واستبقاء المستخدمين بنسبة 30%.",
                "op4": "نفذت Zustand لإدارة الحالة العامة و i18n للدعم متعدد اللغات في التطبيق.",
                "op5": "طورت تدفقات تكامل REST API مع خلفية مبنية على .NET، محسناً الأداء وقابلية الصيانة."
            },
            "sde1": {
                "title": "مهندس تطوير البرمجيات 1",
                "period": "يونيو 2021 – يونيو 2023",
                "op1": "صممت وحافظت على محرك حجز قوي يخدم أكثر من 10,000 مستخدم، مع توفر عالي وتجربة مستخدم متجاوبة.",
                "op2": "حسنت نقاط Lighthouse من 55 إلى 90+، مقللاً أوقات التحميل بحوالي 45% من خلال تحسين الأداء.",
                "op3": "عززت SEO من خلال HTML الدلالي والعلامات الوصفية والبيانات المنظمة وخرائط الموقع، محسناً القابلية للاكتشاف.",
                "op4": "ضمنت امتثال إمكانية الوصول WCAG عبر جميع مكونات واجهة المستخدم باستخدام ARIA ودعم لوحة المفاتيح.",
                "op5": "بنيت ميزات باستخدام React.js و Redux و SCSS و Material UI، ضامناً قاعدة كود واجهة أمامية معيارية وقابلة للتوسع."
            },
            "intern": {
                "title": "متدرب تطوير البرمجيات",
                "period": "يناير 2021 – مايو 2021",
                "op1": "دمجت Google Analytics 4 لتمكين رؤى غنية لسلوك المستخدم وقرارات واجهة المستخدم المدفوعة بالبيانات.",
                "op2": "نفذت التدويل (i18n) لواجهة المستخدم متعددة اللغات، موسعاً إمكانية وصول المنتج للمستخدمين العالميين.",
                "op3": "بنيت مكونات واجهة مستخدم قابلة لإعادة الاستخدام مع React.js، متماشياً مع إرشادات نظام التصميم.",
                "op4": "ساهمت في اختبار الوحدة ومراجعة الكود، محافظاً على جودة الكود ومحسناً ثقة CI/CD."
            }
        },
        "terminalLogEnd": {
            "end": "نهاية السجل",
            "status": " [  الحالة  ] شجرة الخبرة مستقرة",
            "nextSync": " [  المزامنة التالية  ] T+30d"
        }
    },
    "Footer": {
        "tagline": "تصميم الواجهات على حافة الخيال. مدفوع بالكود والفضول وقليل من الفوضى."
    },
    "Header": {
        "navLinks": {
            "home": "الرئيسية",
            "about": "نبذة عني",
            "skills": "المهارات",
            "projects": "المشاريع",
            "xp": "الخبرة"
        },
        "buttons": {
            "contact": "اتصل بي",
            "close": "إغلاق"
        },
        "languageSelector": {
            "label": "اللغة"
        }
    },
    "Home": {
        "headline": "مرحباً بك في الشبكة",
        "description": "الشبكة. حدود رقمية. الدوائر النيونية تغذي أنظمة مبنية من المنطق، لكن مشكلة بالإبداع. إنها مساحة حيث الهوية مكتوبة بالكود والأفكار تتطور مع كل ضغطة مفتاح. الخلل لا يكسر الأشياء — يكشفها. هذه ليست مجرد شبكة؛ إنها انعكاس للخيال البشري.",
        "buttons": {
            "skills": "مصفوفة المهارات",
            "projects": "أرشيف المشاريع"
        }
    },
    "Projects": {
        "sectionTitle": "أرشيف المشاريع",
        "private": "خاص",
        "live": "مباشر",
        "github": "Github",
        "cards": {
            "skinbattle": {
                "title": "SkinBattle.gg",
                "subtitle": "منصة معارك أسلحة CS:GO",
                "description": "SkinBattle.gg هي منصة ديناميكية حيث يتنافس المستخدمون في معارك أسلحة CS:GO في الوقت الفعلي. مبنية بـ Next.js و Material UI و Redux Toolkit، تقدم واجهة سلسة ومتجاوبة مع تفاعلات اللعب المباشر. تدعم المنصة تسجيل الدخول الآمن والتحديثات في الوقت الفعلي باستخدام WebSocket وتدمج منطق اللعبة المعقد مع الحفاظ على حالة متسقة عبر واجهة المستخدم. مصمم مع الأداء العالي ومشاركة المستخدم في الاعتبار، يعكس هذا المشروع المستقل مزيجاً مصقولاً من هندسة الواجهة الأمامية والتصميم المتمحور حول المستخدم."
            },
            "hookpilot": {
                "title": "Hookpilot",
                "subtitle": "مدير Git Hook مرن لتدفقات العمل التطويرية الحديثة",
                "description": "Hookpilot هو مدير خطافات Git قابل للتكوين مصمم لتبسيط تدفقات عمل التطوير وفرض أفضل الممارسات. يدعم الخطافات المحددة مسبقاً والمخصصة للمهام مثل التدقيق والاختبار والتنسيق وتدقيق الأمان وفحوصات التبعية والتحقق من رسائل الالتزام والمزيد. مع واجهة سطر أوامر تفاعلية وإعدادات خاصة بالبيئة ودعم التجاوز عبر --no-verify، Hookpilot مثالي للفرق التي تريد أتمتة بوابات الجودة والإطلاق بثقة."
            },
            "felis": {
                "title": "Felis AI",
                "subtitle": "روبوت دردشة خاص للبحث والذاكرة",
                "description": "Felis AI هو مساعد بحث مخصص بعمق مدعوم بتقنيات RAG (Retrieval-Augmented Generation) المتقدمة. يمزج بذكاء توليد الذكاء الاصطناعي الواعي بالسياق مع استرجاع الوثائق الديناميكي لتقديم محادثات دقيقة ومستمرة في الذاكرة. مصمم بـ LangChain لتدفقات عمل الذكاء الاصطناعي المعيارية ومدعوم بـ Supabase للتخزين الشعاعي الآمن، يتفوق Felis في مساعدة البحث وتوليد الأفكار وعمل المعرفة طويل المدى. واجهته—مبنية بـ ShadCN UI و Tailwind CSS—تتميز بانتقالات الموضوع والتدفقات المتحركة وتجربة مستخدم معبرة عاطفياً، مدمجة العمق التقني مع التصميم المؤثر."
            },
            "javascriptverse": {
                "title": "JavaScript-Verse",
                "subtitle": "ملعب JavaScript و React في المتصفح مع التنفيذ المباشر",
                "description": "JavaScript-Verse هو بيئة برمجة قوية في المتصفح مصممة خصيصاً لتطوير JavaScript و React. يدعم تنفيذ الكود في الوقت الفعلي وتحويل JSX باستخدام Babel والمعاينة المباشرة عبر صناديق الرمل iframe الآمنة. تمكن المنصة استيراد وحدات NPM في وقت التشغيل واستدعاءات API وميزات مثل الكود القابل للتصدير وأوراق الغش البرمجية والوثائق المدمجة بـ markdown. يمكن للمطورين كتابة كود معياري متعدد الخلايا وحتى التعامل مع بيانات الاستيراد بفضل خيارات التجميع المدمجة باستخدام Webpack أو ESBuild. مصمم للأغراض التعليمية والاستكشافية والتعاونية، يؤكد JavaScript-Verse على الأمان والتفاعل وبيئة العمل للمطور."
            },
            "filesqueeze": {
                "title": "FileSqueeze",
                "subtitle": "محسن حجم الملفات للمطورين",
                "description": "FileSqueeze هو أداة سطر أوامر خفيفة مصممة للمطورين لضغط وتحسين أصول المشروع أثناء مرحلة البناء أو النشر. يدعم تنسيقات مثل JS و JSON و HTML و CSS، ويمكن أوقات تحميل أسرع وأحجام حزم أصغر دون التضحية بالجودة. مبني بـ Node.js ومتاح عبر npm، يتكامل FileSqueeze بسهولة في خطوط أنابيب CI/CD وتدفقات عمل التطوير المحلية. يؤكد المشروع على تحكم المطور وقابلية التكوين والأداء السريع البرق."
            }
        }
    },
    "Skills": {
        "title": "مصفوفة المهارات",
        "footer": "اكتملت معايرة الدائرة. جميع القدرات تعمل بكامل طاقتها"
    }
}