{
    "Page": {
        "sections": {
            "skillsModule": "/// SKILLS.MODULE",
            "experienceModule": "/// XP.MODULE",
            "loading": "loading..."
        }
    },
    "About": {
        "title": "Identity Log",
        "paragraph1": "I build at the intersection of identity, code, and imagination, where every component is a signal in the constant exchange between human and machine. My work is modular, reactive, and wired with intent like circuits pulsing through a living interface.",
        "paragraph2": "I design systems that feel alive. Every pixel has a reason to exist. Every animation is a conversation. Whether it’s React, Tailwind, shaders, or state machines, my tools shape responsive, immersive experiences that feel as much as they function.",
        "paragraph3": "This isn’t just a portfolio. It’s a grid. A reflection of how I think, create, and connect. A space where creativity flows like data and interfaces hum with energy.",
        "closing": "I’m HUMBLEF0OL—welcome to my circuit.",
        "location_latlong": "LAT: 28.5143629° N | LONG: 77.0730087° E",
        "location_sysid": "GRID: SECTOR-21E / SYS-ID: HUMBLEF0OL"
    },
    "Contact": {
        "sectionTitle": "Contact",
        "introTitle": "You've reached HUMBLEFOOL'S transmission terminal, the neural gateway where code meets conversation.",
        "uplinkMessage": "Whether you're a fellow dev, an idea-crafter, or a recruiter from the future — this is your uplink. Fire a message, and I’ll route it through my neural grid.",
        "terminalLabel": "NEURAL_TERMINAL_v2.1",
        "terminalMessages": {
            "linkEstablished": "NEURAL_LINK_ESTABLISHED...",
            "scanningThreats": "SCANNING_FOR_THREATS...",
            "firewallActive": "FIREWALL_ACTIVE...",
            "readyTransmission": "READY_FOR_TRANSMISSION...",
            "awaitingInput": "AWAITING_INPUT..."
        },
        "statusOnline": "ONLINE",
        "statusSecure": "SECURE",
        "statusMonitored": "MONITORED",
        "form": {
            "title": "SECURE_TRANSMISSION",
            "nameLabel": "NAME_INPUT",
            "namePlaceholder": "Enter your signature...",
            "emailLabel": "EMAIL_PROTOCOL",
            "emailPlaceholder": "your@email.com",
            "messageLabel": "MESSAGE_PAYLOAD",
            "messagePlaceholder": "Transmit your data packet...",
            "sendButton": "Send Message",
            "sendingButton": "Sending..."
        },
        "footerStatus": "SYSTEM_STATUS: OPERATIONAL",
        "footerTime": "LOCALE_TIME"
    },
    "CyberIDCard": {
        "header": {
            "title": "Identity Broadcast",
            "subtitle": "Secure Session",
            "id": "ID: HUMBLEFOOL-G7KX",
            "ping": "Ping Code: 9XK-JU42-FELIS"
        },
        "identity": {
            "nameLabel": "Name",
            "nameValue": "Amit Rana",
            "roleLabel": "Role",
            "roleValue": "Senior Development Engineer",
            "statusLabel": "Status",
            "statusValue": "Online",
            "versionLabel": "Version",
            "versionValue": "v3.2.7"
        },
        "log": {
            "auth": "[ OK ] Auth: Success",
            "github": "[ SYS ] GitHub Linked",
            "memory": "[ CORE ] Memory Booted: 92%",
            "renderer": "[ NODE ] Visual Renderer: Stable",
            "creativity": "[ INFO ] Creativity Engine: Active"
        },
        "barcode": {
            "label": "// SERIALIZED ID CODE //"
        }
    },
    "Experience": {
        "sectionTitle": "Experience Log",
        "terminalLogStart": {
            "userId": " [  USER.ID  ] _HUMBLEF00L_",
            "accessLevel": " [  ACCESS LEVEL  ] AUTHORIZED // CLEARANCE: TIER-03",
            "timeframe": " [  TIMEFRAME  ] ACTIVITY LOG -- 2022 ▶ 2025"
        },
        "tabs": {
            "sde2": {
                "labelFull": "SOFTWARE DEVELOPMENT ENGINEER 2",
                "labelShort": "SDE 2"
            },
            "sde1": {
                "labelFull": "SOFTWARE DEVELOPMENT ENGINEER 1",
                "labelShort": "SDE 1"
            },
            "intern": {
                "labelFull": "SOFTWARE DEVELOPMENT INTERN",
                "labelShort": "SDE INTERN"
            }
        },
        "content": {
            "operationsLabel": "Operations",
            "sde2": {
                "title": "Software Development Engineer 2",
                "period": "July 2023 – Present",
                "op1": "Architected and shipped a scalable frontend used by 300K+ users using Next.js and Tailwind CSS, achieving 95+ Core Web Vitals across performance, SEO, and accessibility.",
                "op2": "Designed frontend architecture while leading cross-functional collaboration with product, backend, and design teams.",
                "op3": "Integrated PWA features to boost mobile engagement and user retention by 30%.",
                "op4": "Implemented Zustand for global state management and i18n for multilingual support across the app.",
                "op5": "Developed REST API integration workflows with a .NET-based backend, improving performance and maintainability."
            },
            "sde1": {
                "title": "Software Development Engineer 1",
                "period": "June 2021 – June 2023",
                "op1": "Engineered and maintained a robust booking engine serving 10,000+ users, with high availability and responsive UX.",
                "op2": "Improved Lighthouse scores from 55 to 90+, cutting load time by ~45% through performance optimization.",
                "op3": "Enhanced SEO via semantic HTML, meta tags, structured data, and sitemaps, improving discoverability.",
                "op4": "Ensured WCAG accessibility compliance across all UI components using ARIA and keyboard support.",
                "op5": "Built features using React.js, Redux, SCSS, and Material UI, ensuring a modular, scalable frontend codebase."
            },
            "intern": {
                "title": "Software Development Intern",
                "period": "Jan 2021 – May 2021",
                "op1": "Integrated Google Analytics 4 to enable rich user behavior insights and data-driven UI decisions.",
                "op2": "Implemented internationalization (i18n) for multilingual UI, expanding product accessibility for global users.",
                "op3": "Built reusable UI components with React.js, aligning with design system guidelines.",
                "op4": "Contributed to unit testing and code reviews, maintaining code quality and improving CI/CD confidence."
            }
        },
        "terminalLogEnd": {
            "end": "END OF LOG",
            "status": " [  STATUS  ] EXPERIENCE TREE STABLE",
            "nextSync": " [  NEXT SYNC  ] T+30d"
        }
    },
    "Footer": {
        "tagline": "Architecting interfaces at the edge of imagination. Powered by code, curiosity & a little chaos."
    },
    "Header": {
        "navLinks": {
            "home": "Home",
            "about": "About",
            "skills": "Skills",
            "projects": "Projects",
            "xp": "Work XP"
        },
        "buttons": {
            "contact": "Contact",
            "close": "Close"
        },
        "languageSelector": {
            "label": "Language"
        }
    },
    "Home": {
        "headline": "Welcome to the Grid",
        "description": "The Grid. A digital frontier. Neon circuits power systems built from logic, but shaped by creativity. It’s a space where identity is written in code and ideas evolve with every keystroke. Glitches don’t break things — they reveal them. This isn’t just a network; it’s a reflection of human imagination.",
        "buttons": {
            "skills": "Skill Matrix",
            "projects": "Project Archives"
        }
    },
    "Projects": {
        "sectionTitle": "Project Archive",
        "private": "PRIVATE",
        "live": "Live",
        "github": "Github",
        "cards": {
            "skinbattle": {
                "title": "SkinBattle.gg",
                "subtitle": "CS:GO Skin Battle Platform",
                "description": "SkinBattle.gg is a dynamic platform where users compete in real-time CS:GO skin battles. Built with Next.js, Material UI, and Redux Toolkit, it delivers a seamless, responsive interface with live gameplay interactions. The platform supports secure login, real-time updates using WebSockets, and integrates complex game logic while maintaining consistent state across the UI. Designed with high performance and user engagement in mind, this freelance project reflects a polished mix of frontend engineering and user-centric design."
            },
            "hookpilot": {
                "title": "Hookpilot",
                "subtitle": "Flexible Git Hook Manager for Modern Dev Workflows",
                "description": "Hookpilot is a configurable Git hook manager designed to streamline development workflows and enforce best practices. It supports predefined and custom hooks for tasks like linting, testing, formatting, security audits, dependency checks, commit message validation, and more. With an interactive CLI, environment-specific setups, and support for overrides via --no-verify, Hookpilot is ideal for teams looking to automate quality gates and ship confidently."
            },
            "felis": {
                "title": "Felis AI",
                "subtitle": "Private Research & Memory Chatbot",
                "description": "Felis AI is a deeply personalized research assistant powered by advanced RAG (Retrieval-Augmented Generation) techniques. It intelligently fuses context-aware AI generation with dynamic document retrieval to deliver precise, memory-persistent conversations. Designed with LangChain for modular AI workflows and backed by Supabase for secure vector storage, Felis excels at assisting in research, ideation, and long-form knowledge work. Its interface—built with ShadCN UI and Tailwind CSS—features theme transitions, animated flows, and an emotionally expressive UX, blending technical depth with heartfelt design."
            },
            "javascriptverse": {
                "title": "JavaScript-Verse",
                "subtitle": "In-Browser JavaScript & React Playground with Live Execution",
                "description": "JavaScript-Verse is a powerful in-browser coding environment tailored for JavaScript and React development. It supports real-time code execution, JSX transpilation using Babel, and live preview via secure iframe sandboxes. The platform enables NPM module imports at runtime, API calls, and features like exportable code, coding cheatsheets, and markdown-integrated documentation. Developers can write modular, multi-cell code and even handle import statements thanks to integrated bundling options using Webpack or ESBuild. Designed for educational, exploratory, and collaborative purposes, JavaScript-Verse emphasizes security, interactivity, and developer ergonomics."
            },
            "filesqueeze": {
                "title": "FileSqueeze",
                "subtitle": "File Size Optimizer for Developers",
                "description": "FileSqueeze is a lightweight CLI tool designed for developers to compress and optimize project assets during the build or deployment phase. Supporting formats like JS, JSON, HTML, and CSS, it enables faster load times and smaller bundle sizes without sacrificing quality. Built with Node.js and available via npm, FileSqueeze integrates easily into CI/CD pipelines and local development workflows. The project emphasizes developer control, configurability, and blazing fast performance."
            }
        }
    },
    "Skills": {
        "title": "Skill Matrix",
        "footer": "Circuit calibration complete. All capabilities fully operational"
    }
}